KB6003/Tutorial2/end/ahmed/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         1000.0;

deltaT          1;

writeControl    timeStep;

writeInterval   50;

purgeWrite      0;

writeFormat     ascii;

writePrecision  8;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;
//////////////////////////////////////////////////////////////////////////////////
functions
{
/////////////////////////////////////////
minmaxdomain
{
	type 		fieldMinMax;
	
	functionObjectLibs ("libfieldFunctionObjects.so");

	enabled 	true;
	log 		true;

	mode 		component;

	writeControl 	timeStep;
	writeInterval 	1;

	fields 		(p U k omega nut);
}
/////////////////////////////////////////
forces_object
{
	type forces;
	functionObjectLibs ("libforces.so");

        enabled     	true;
        log         	yes;

	writeControl    timeStep;
	writeInterval   1;

	patches 	("ahmed");

	pName 		p;
	Uname 		U;

	rho 		rhoInf;
	rhoInf 		1.225;

	CofR 	(0 0 0);
}
/////////////////////////////////////////
forcesCoe_object
{
    	type            forceCoeffs;

    	libs            ("libforces.so");

   	 writeControl   timeStep;
    	timeInterval    1;

    	patches 	("ahmed");

        enabled     	true;
        log         	yes;

    	magUInf     	30;
   	lRef        	0.288;
    	Aref        	0.115;

    	rhoInf	    	1.225;
    	rho	    	rhoInf;

    	liftDir     	(0 0 1);
    	dragDir     	(1 0 0);

    	CofR        	(0 0 0);
    	pitchAxis   	(0 1 0);

}
/////////////////////////////////////////
}


// ************************************************************************* //
